LIAO-ZI-JIE/STM32_quadcopter/Hardware/Serial.c
	}	
/////////////////////////////////////////////////////////////////////////////////////
	else if(f.send_pid2)
	{
		f.send_pid2 = 0;
//		ANO_DT_Send_PID(2,PID_ROL_Angle.P,PID_ROL_Angle.I,PID_ROL_Angle.D,
//						  PID_PIT_Angle.P,PID_PIT_Angle.I,PID_PIT_Angle.D,
//		                  PID_YAW_Angle.P,PID_YAW_Angle.I,PID_YAW_Angle.D);
		ANO_DT_Send_PID(2,PID_Roll_Structure.outer.kp,PID_Roll_Structure.outer.ki,PID_Roll_Structure.outer.kd,
				  0,1,32,
				  0,1,32);
	}
/////////////////////////////////////////////////////////////////////////////////////
	else if(f.send_pid3)
	{
		f.send_pid3 = 0;
		
		
		
	  ANO_DT_Send_PID(3,PID_Structure.kp,PID_Structure.ki,PID_Structure.kd,
		                  1,0.1,0,0,0,1);
		
		
	}else if(f.send_pid4)//清除上位机PID数据显示
	{
		f.send_pid4 = 0;
		ANO_DT_Send_PID(1,0.65,0.035,0.38,0.65,0.035,0.38,2,0.05,0.68);
		ANO_DT_Send_PID(2,2.4,0.01,0,2.4,0.01,0,5,0,0);
		ANO_DT_Send_PID(3,0,0,0,0,0,0,0,0,0);
	}

}

/************************************************************************************

* Send_Data函数是协议中所有发送数据功能使用到的发送函数
* 移植时，用户应根据自身应用的情况，根据使用的通信方式，实现此函数

*************************************************************************************/
void ANO_DT_Send_Data(uint8_t *dataToSend , uint8_t length)
{
	Serial_SendArray(dataToSend, length);
}

static void ANO_DT_Send_Check(uint8_t head, uint8_t check_sum)
{
	uint8_t sum = 0,i;
	data_to_send[0]=0xAA;
	data_to_send[1]=0xAA;
	data_to_send[2]=0xEF;
	data_to_send[3]=2;
	data_to_send[4]=head;
	data_to_send[5]=check_sum;
	
	for(i=0;i<6;i++)
		sum += data_to_send[i];
	data_to_send[6]=sum;

	ANO_DT_Send_Data(data_to_send, 7);
}

/******************************************************************************************************************
* Data_Receive_Prepare函数是协议预解析，根据协议的格式，将收到的数据进行一次格式性解析，格式正确的话再进行数据解析
* 移植时，此函数应由用户根据自身使用的通信方式自行调用，比如串口每收到一字节数据，则调用此函数一次
* 此函数解析出符合格式的数据帧后，会自行调用数据解析函数
******************************************************************************************************************/
void ANO_DT_Data_Receive_Prepare(uint8_t data)
{
	static uint8_t RxBuffer[50];
	static uint8_t _data_len = 0,_data_cnt = 0;
	static uint8_t state = 0;
	
	if(state==0&&data==0xAA)
	{
		state=1;
		RxBuffer[0]=data;
	}
	else if(state==1&&data==0xAF)
	{
		state=2;
		RxBuffer[1]=data;
	}
	else if(state==2&&data<0XF1)
	{
		state=3;
		RxBuffer[2]=data;
	}
	else if(state==3&&data<50)
	{
		state = 4;
		RxBuffer[3]=data;
		_data_len = data;
		_data_cnt = 0;
	}
	else if(state==4&&_data_len>0)
	{
		_data_len--;
		RxBuffer[4+_data_cnt++]=data;
		if(_data_len==0)
			state = 5;
	}
	else if(state==5)
	{
		state = 0;
		RxBuffer[4+_data_cnt]=data;
		ANO_DT_Data_Receive_Anl(RxBuffer,_data_cnt+5);
	}
	else
		state = 0;
}
/************************************************************************************************************
* Data_Receive_Anl 函数是协议数据解析函数，函数参数是符合协议格式的一个数据帧，该函数会首先对协议数据进行校验
* 校验通过后对数据进行解析，实现相应功能
* 此函数可以不用用户自行调用，由函数 Data_Receive_Prepare 自动调用
************************************************************************************************************/
void ANO_DT_Data_Receive_Anl(uint8_t *data_buf,uint8_t num)
{
	uint8_t sum = 0,i;
	for(i=0;i<(num-1);i++)
		sum += *(data_buf+i);
	if(!(sum==*(data_buf+num-1)))		return;		//判断sum
	if(!(*(data_buf)==0xAA && *(data_buf+1)==0xAF))		return;		//判断帧头
	
	if(*(data_buf+2)==0X01)
	{
		if(*(data_buf+4)==0X01)
		{

			MPU9250_Acc_Gryo_Calibrate_flag=1;
//			SENSER_FLAG_SET(ACC_OFFSET);//加速度校准
//			ACC_OFFSET_RAW.X = 0;ACC_OFFSET_RAW.Y = 0;ACC_OFFSET_RAW.Z = 0;
		}
		if(*(data_buf+4)==0X02)
		{
			MPU9250_Acc_Gryo_Calibrate_flag=1;
//			SENSER_FLAG_SET(GYRO_OFFSET);//陀螺仪校准
//			GYRO_OFFSET_RAW.X = 0;GYRO_OFFSET_RAW.Y = 0;GYRO_OFFSET_RAW.Z = 0;
		}
		if(*(data_buf+4)==0X03)
		{
			MPU9250_Acc_Gryo_Calibrate_flag=1;
//			SENSER_FLAG_SET(ACC_OFFSET);//加速度校准
//			SENSER_FLAG_SET(GYRO_OFFSET);//陀螺仪校准
		}
		if(*(data_buf+4)==0X04)
		{
//			flag ^= 0x01;
//			if(flag)
//				Airplane_Enable = 1;
//			else
//				Airplane_Enable = 0;
		}
//		PID_WriteFlash(); //清除原来零偏
	}
	
	if(*(data_buf+2)==0X02)
	{
		if(*(data_buf+4)==0X01)
		{
			f.send_pid1 = 1;//读取PID1
			f.send_pid2 = 1;//读取PID2
			f.send_pid3 = 1;//读取PID3
		}
		if(*(data_buf+4)==0X02)
		{
			
		}
		if(*(data_buf+4)==0XA0)		//读取版本信息
		{
			f.send_version = 1;
		}
		if(*(data_buf+4)==0XA1)		//恢复默认参数
		{
			//Para_ResetToFactorySetup();
			f.send_pid4 = 1;        //参数清零
		}
	}

	if(*(data_buf+2)==0X10)								//PID1
    {
        PID_Roll_Structure.inner.kp = 0.001*( (vs16)(*(data_buf+4)<<8)|*(data_buf+5) );
        PID_Roll_Structure.inner.ki = 0.001*( (vs16)(*(data_buf+6)<<8)|*(data_buf+7) );
        PID_Roll_Structure.inner.kd = 0.001*( (vs16)(*(data_buf+8)<<8)|*(data_buf+9) );
//        PID_ROL_Rate.P = 0.001*( (vs16)(*(data_buf+4)<<8)|*(data_buf+5) );
//        PID_ROL_Rate.I = 0.001*( (vs16)(*(data_buf+6)<<8)|*(data_buf+7) );
//        PID_ROL_Rate.D = 0.001*( (vs16)(*(data_buf+8)<<8)|*(data_buf+9) );
//        PID_PIT_Rate.P = 0.001*( (vs16)(*(data_buf+10)<<8)|*(data_buf+11) );
//        PID_PIT_Rate.I = 0.001*( (vs16)(*(data_buf+12)<<8)|*(data_buf+13) );
//        PID_PIT_Rate.D = 0.001*( (vs16)(*(data_buf+14)<<8)|*(data_buf+15) );
//        PID_YAW_Rate.P = 0.001*( (vs16)(*(data_buf+16)<<8)|*(data_buf+17) );
//        PID_YAW_Rate.I = 0.001*( (vs16)(*(data_buf+18)<<8)|*(data_buf+19) );
//        PID_YAW_Rate.D = 0.001*( (vs16)(*(data_buf+20)<<8)|*(data_buf+21) );
		
        ANO_DT_Send_Check(*(data_buf+2),sum);

    }
    if(*(data_buf+2)==0X11)								//PID2
    {
		
		PID_Roll_Structure.outer.kp = 0.001*( (vs16)(*(data_buf+4)<<8)|*(data_buf+5) );
        PID_Roll_Structure.outer.ki = 0.001*( (vs16)(*(data_buf+6)<<8)|*(data_buf+7) );
        PID_Roll_Structure.outer.kd = 0.001*( (vs16)(*(data_buf+8)<<8)|*(data_buf+9) );
//        PID_ROL_Angle.P 	= 0.001*( (vs16)(*(data_buf+4)<<8)|*(data_buf+5) );
//        PID_ROL_Angle.I 	= 0.001*( (vs16)(*(data_buf+6)<<8)|*(data_buf+7) );
//        PID_ROL_Angle.D 	= 0.001*( (vs16)(*(data_buf+8)<<8)|*(data_buf+9) );
//        PID_PIT_Angle.P 	= 0.001*( (vs16)(*(data_buf+10)<<8)|*(data_buf+11) );
//        PID_PIT_Angle.I 	= 0.001*( (vs16)(*(data_buf+12)<<8)|*(data_buf+13) );
//        PID_PIT_Angle.D 	= 0.001*( (vs16)(*(data_buf+14)<<8)|*(data_buf+15) );
//        PID_YAW_Angle.P	 = 0.001*( (vs16)(*(data_buf+16)<<8)|*(data_buf+17) );
//        PID_YAW_Angle.I 	= 0.001*( (vs16)(*(data_buf+18)<<8)|*(data_buf+19) );
//        PID_YAW_Angle.D 	= 0.001*( (vs16)(*(data_buf+20)<<8)|*(data_buf+21) );
        ANO_DT_Send_Check(*(data_buf+2),sum);

