LIAO-ZI-JIE/STM32_quadcopter/Hardware/Serial.c
    }
  if(*(data_buf+2)==0X12)								//PID3
  {	
		PID_Structure.kp 	= 0.001*( (vs16)(*(data_buf+4)<<8)|*(data_buf+5) );
		PID_Structure.ki 	= 0.001*( (vs16)(*(data_buf+6)<<8)|*(data_buf+7) );
		PID_Structure.kd 	= 0.001*( (vs16)(*(data_buf+8)<<8)|*(data_buf+9) );
//		PID_ALT_Rate.P 	= 0.001*( (vs16)(*(data_buf+4)<<8)|*(data_buf+5) );
//		PID_ALT_Rate.I 	= 0.001*( (vs16)(*(data_buf+6)<<8)|*(data_buf+7) );
//		PID_ALT_Rate.D 	= 0.001*( (vs16)(*(data_buf+8)<<8)|*(data_buf+9) );
//		PID_ALT.P 	= 0.001*( (vs16)(*(data_buf+10)<<8)|*(data_buf+11) );
//		PID_ALT.I 	= 0.001*( (vs16)(*(data_buf+12)<<8)|*(data_buf+13) );
//		PID_ALT.D 	= 0.001*( (vs16)(*(data_buf+14)<<8)|*(data_buf+15) );
//		PID_ALT.P	  = 0.001*( (vs16)(*(data_buf+16)<<8)|*(data_buf+17) );
//		PID_ALT.I 	= 0.001*( (vs16)(*(data_buf+18)<<8)|*(data_buf+19) );
//		PID_ALT.D 	= 0.001*( (vs16)(*(data_buf+20)<<8)|*(data_buf+21) );
		ANO_DT_Send_Check(*(data_buf+2),sum);
  }
	if(*(data_buf+2)==0X13)								//PID4
	{
		ANO_DT_Send_Check(*(data_buf+2),sum);
	}
	if(*(data_buf+2)==0X14)								//PID5
	{
		ANO_DT_Send_Check(*(data_buf+2),sum);
	}
	if(*(data_buf+2)==0X15)								//PID6
	{
		ANO_DT_Send_Check(*(data_buf+2),sum);
	}
}

//void ANO_DT_Send_Version(uint8_t hardware_type, u16 hardware_ver,u16 software_ver,u16 protocol_ver,u16 bootloader_ver)
//{
//	uint8_t _cnt=0;
//	data_to_send[_cnt++]=0xAA;
//	data_to_send[_cnt++]=0xAA;
//	data_to_send[_cnt++]=0x00;
//	data_to_send[_cnt++]=0;
//	
//	data_to_send[_cnt++]=hardware_type;
//	data_to_send[_cnt++]=BYTE1(hardware_ver);
//	data_to_send[_cnt++]=BYTE0(hardware_ver);
//	data_to_send[_cnt++]=BYTE1(software_ver);
//	data_to_send[_cnt++]=BYTE0(software_ver);
//	data_to_send[_cnt++]=BYTE1(protocol_ver);
//	data_to_send[_cnt++]=BYTE0(protocol_ver);
//	data_to_send[_cnt++]=BYTE1(bootloader_ver);
//	data_to_send[_cnt++]=BYTE0(bootloader_ver);
//	
//	data_to_send[3] = _cnt-4;
//	
//	uint8_t sum = 0;
//	for(uint8_t i=0;i<_cnt;i++)
//		sum += data_to_send[i];
//	data_to_send[_cnt++]=sum;
//	
//	ANO_DT_Send_Data(data_to_send, _cnt);
//}

void ANO_DT_Send_Status(float angle_rol, float angle_pit, float angle_yaw, s32 alt, uint8_t FLY_ENABLEl, uint8_t armed)
{
	uint8_t _cnt=0,sum = 0,i;
	vs16 _temp;
	vs32 _temp2 = alt;
	
	data_to_send[_cnt++]=0xAA;    
	data_to_send[_cnt++]=0xAA;
	data_to_send[_cnt++]=0x01;   
	data_to_send[_cnt++]=0;      
	
	_temp = (int)(angle_rol*100); 
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	_temp = (int)(angle_pit*100);
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	_temp = (int)(angle_yaw*100);
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	
	data_to_send[_cnt++]=BYTE3(_temp2);
	data_to_send[_cnt++]=BYTE2(_temp2);
	data_to_send[_cnt++]=BYTE1(_temp2);
	data_to_send[_cnt++]=BYTE0(_temp2);
	
	data_to_send[_cnt++] = FLY_ENABLEl;
	
	data_to_send[_cnt++] = armed;
	
	data_to_send[3] = _cnt-4;
	
	for(i=0;i<_cnt;i++)
		sum += data_to_send[i];
	data_to_send[_cnt++]=sum;
	
	ANO_DT_Send_Data(data_to_send, _cnt);
}
void ANO_DT_Send_Senser(int16_t a_x,int16_t a_y,int16_t a_z,int16_t g_x,int16_t g_y,int16_t g_z,int16_t m_x,int16_t m_y,int16_t m_z,s32 bar)
{
	uint8_t _cnt=0,sum = 0,i;
	vs16 _temp;
	
	data_to_send[_cnt++]=0xAA;
	data_to_send[_cnt++]=0xAA;
	data_to_send[_cnt++]=0x02;
	data_to_send[_cnt++]=0;
	
	_temp = a_x;
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	_temp = a_y;
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	_temp = a_z;	
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	
	_temp = g_x;	
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	_temp = g_y;	
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	_temp = g_z;	
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	
	_temp = m_x;	
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	_temp = m_y;	
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	_temp = m_z;	
	data_to_send[_cnt++]=BYTE1(_temp);
	data_to_send[_cnt++]=BYTE0(_temp);
	
	data_to_send[3] = _cnt-4;
	
	
	for(i=0;i<_cnt;i++)
		sum += data_to_send[i];
	data_to_send[_cnt++] = sum;
	
	ANO_DT_Send_Data(data_to_send, _cnt);
}
void ANO_DT_Send_RCData(u16 thr,u16 yaw,u16 rol,u16 pit,u16 aux1,u16 aux2,u16 aux3,u16 aux4,u16 aux5,u16 aux6)
{
	uint8_t _cnt=0,sum = 0,i;

	data_to_send[_cnt++]=0xAA;         //帧头
	data_to_send[_cnt++]=0xAA;
	data_to_send[_cnt++]=0x03;         //功能字
	data_to_send[_cnt++]=0;            //数据长度
	data_to_send[_cnt++]=BYTE1(thr);   //油门
	data_to_send[_cnt++]=BYTE0(thr);   
	data_to_send[_cnt++]=BYTE1(yaw);   //航向角
	data_to_send[_cnt++]=BYTE0(yaw);   
	data_to_send[_cnt++]=BYTE1(rol);   //横滚
	data_to_send[_cnt++]=BYTE0(rol); 
	data_to_send[_cnt++]=BYTE1(pit);   //俯仰
	data_to_send[_cnt++]=BYTE0(pit);
	data_to_send[_cnt++]=BYTE1(aux1);
	data_to_send[_cnt++]=BYTE0(aux1);
	data_to_send[_cnt++]=BYTE1(aux2);
	data_to_send[_cnt++]=BYTE0(aux2);
	data_to_send[_cnt++]=BYTE1(aux3);
	data_to_send[_cnt++]=BYTE0(aux3);
	data_to_send[_cnt++]=BYTE1(aux4);
	data_to_send[_cnt++]=BYTE0(aux4);
	data_to_send[_cnt++]=BYTE1(aux5);
	data_to_send[_cnt++]=BYTE0(aux5);
	data_to_send[_cnt++]=BYTE1(aux6);
	data_to_send[_cnt++]=BYTE0(aux6);

	data_to_send[3] = _cnt-4;         //数据帧长度赋值
	
	for(i=0;i<_cnt;i++)             
		sum += data_to_send[i];         //数据校验求解
	
	data_to_send[_cnt++]=sum;         //数据校验赋值
	
	ANO_DT_Send_Data(data_to_send, _cnt); //帧发送
}
void ANO_DT_Send_Power(u16 votage, u16 current)
{
	uint8_t _cnt=0,sum = 0,i;
	u16 temp;
	
	data_to_send[_cnt++]=0xAA;
	data_to_send[_cnt++]=0xAA;
	data_to_send[_cnt++]=0x05;
	data_to_send[_cnt++]=0;
	
	temp = votage;
	data_to_send[_cnt++]=BYTE1(temp);
	data_to_send[_cnt++]=BYTE0(temp);
	temp = current;
	data_to_send[_cnt++]=BYTE1(temp);
	data_to_send[_cnt++]=BYTE0(temp);
	
	data_to_send[3] = _cnt-4;
	
  
	for(i=0;i<_cnt;i++)
		sum += data_to_send[i];
	
	data_to_send[_cnt++]=sum;
	
